dating/app/controllers/photos_controller.rb

  def create
    @photo = Photo.create!(photo_params)
    @photos = Photo.all
---
INSERT INTO "photos" ("url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
SELECT "photos".* FROM "photos"

  def destroy
    @photo = Photo.find(params[:id])
    @photo.delete
    @photos = Photo.all
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 3]]
SELECT "photos".* FROM "photos"