dating/app/controllers/users_controller.rb

  def create
    username = params[:username]
    password = params[:password]

    new_user = User.create({
      password: password,
      username: username
    })

    user = User.find_from_credentials username, password
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "tester7"], ["LIMIT", 1]]

  def login
    username = params[:username]
    password = params[:password]

    user = User.find_from_credentials username, password
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "tester"], ["LIMIT", 1]]

  def update
    bio = params[:bio]
    @user = User.find(params[:id])
    @user.update(bio: bio)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "bio" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["bio", "qweqweqweqwe"], ["updated_at", "2018-03-12 00:30:32.243264"], ["id", 9]]

  def photos
    user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]